Autodesk.Revit.DB.ForgeTypeId.IsValidIdentifier(System.String)
Checks if the given string conforms to the expected structure of a schema identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021